app/views/admin/hospital_admin.html.erb

	  <td>  <%= h.phone %> </td>
	  <td>  <%= h.users.where(role: 'doctore').count %> </td>
	  <td>  <%= h.users.where(role: 'patients').count %> </td>
	  <td>  <%= h.users.count %> </td>
---
SELECT COUNT(*) FROM "users" INNER JOIN "user_hospitals" ON "users"."id" = "user_hospitals"."user_id" WHERE "user_hospitals"."hospital_id" = ? AND "users"."role" = 'doctore'  [["hospital_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_hospitals" ON "users"."id" = "user_hospitals"."user_id" WHERE "user_hospitals"."hospital_id" = ?  [["hospital_id", 1]]