app/views/admin/users.html.erb

SELECT  "payments".* FROM "payments"  WHERE "payments"."user_id" = ?  ORDER BY "payments"."id" DESC LIMIT 1  [["user_id", 73]]
---
	  <td> <%= user.cupon %></td>
	  <td> <%= user.payments.last %></td>