app/views/users/doctor_parts/_doctor_info.html.erb

SELECT "institutions".* FROM "institutions"  WHERE "institutions"."user_id" = ?  [["user_id", 44]]
---
   <center>
		<% user.institutions.each do |i|%>