app/controllers/admin_controller.rb

  def users
    @users = User.paginate(:page => params[:page], :per_page => 50).order('created_at DESC')
---
SELECT  "users".* FROM "users"   ORDER BY created_at DESC LIMIT 50 OFFSET 0

  def cupons
    @cupons = Cupon.paginate(:page => params[:page], :per_page => 120).order('created_at DESC')
---
SELECT  "cupons".* FROM "cupons"   ORDER BY created_at DESC LIMIT 120 OFFSET 0
SELECT COUNT(*) FROM "cupons"

  def payments
    @payments = Payment.paginate(:page => params[:page], :per_page => 50).order('created_at DESC')
---
SELECT  "payments".* FROM "payments"   ORDER BY created_at DESC LIMIT 50 OFFSET 0

  def stats
    @date = Date.today
    @yesterday = @date - 1.day
    @users = User.count
    @users_yesterday = User.where(created_at: @yesterday).count
    @users_now = User.where(created_at: @date).count
    @doctors = User.where(role: 'doctor').count
    @patients = User.where(role: 'patient').count
    @cronic = Diagnostic.where(:chronic => true).count
    @outstanding = Diagnostic.where(:outstanding => true).count
    @serious = Diagnostic.where(:serious => true).count
    @inconsequential = Diagnostic.where(:inconsequential => true).count
    @t_diagnostics = Diagnostic.count
---
SELECT COUNT(*) FROM "users"  WHERE "users"."created_at" = '2014-12-13'
SELECT COUNT(*) FROM "users"  WHERE "users"."role" = 'doctor'
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."chronic" = 't'
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."outstanding" = 't'
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."serious" = 't'
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."inconsequential" = 't'
SELECT COUNT(*) FROM "diagnostics"

  def sellers_admin
    @sellers = ManagerUser.all
---
SELECT "manager_users".* FROM "manager_users"

  def hospital_admin
     @hospitals = Hospital.all
---
SELECT "hospitals".* FROM "hospitals"