app/controllers/hospitals_controller.rb

INSERT INTO "hospitals" ("created_at", "name", "password", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-15 00:14:41.630083"], ["name", "Locos"], ["password", "12345678"], ["phone", 5959595], ["updated_at", "2014-12-15 00:14:41.630083"]]
---
  def create_hospital
  	@hospital = Hospital.create(name: params[:name], password: params[:password],phone:  params[:phone])