app/controllers/static_views_controller.rb

SELECT  "vital_signs".* FROM "vital_signs"  WHERE "vital_signs"."id" = ? LIMIT 1  [["id", 54]]
---
  def visualizer
    case params[:type]
    when 'signs'
      @find = VitalSign.find(params[:id])