app/controllers/users_controller.rb

  def show
  require 'will_paginate/array'
   @user = User.find(params[:id])
   @user_vital_signs = @user.vital_signs.last(5)
   @user_diagnostics = @user.diagnostics.last(5)
   @user_files = @user.single_files.last(5)
   @personal_cites = @user.doctor_cites.last(7)
   @other_cites = @user.cite_doctors.last(7)
   @tasks =  @other_cites + @personal_cites
   @date = params[:month] ? Date.parse(params[:month]) : Date.today
   @notices = @user.my_request_from_notice.last(5)
   @cronic = @user.diagnostics.where(:chronic => true).count
   @outstanding = @user.diagnostics.where(:outstanding => true).count
   @serious = @user.diagnostics.where(:serious => true).count
   @inconsequential = @user.diagnostics.where(:inconsequential => true).count
---
SELECT "users".* FROM "users"  WHERE "users"."id" IN (45, 46, 47, 48, 50, 51, 52, 54, 70, 88, 89, 90, 91)
SELECT  "vital_signs".* FROM "vital_signs"  WHERE "vital_signs"."user_id" = ?  ORDER BY "vital_signs"."id" DESC LIMIT 5  [["user_id", 91]]
SELECT  "diagnostics".* FROM "diagnostics"  WHERE "diagnostics"."user_id" = ?  ORDER BY "diagnostics"."id" DESC LIMIT 5  [["user_id", 91]]
SELECT  "single_files".* FROM "single_files"  WHERE "single_files"."user_id" = ?  ORDER BY "single_files"."id" DESC LIMIT 5  [["user_id", 91]]
SELECT  "cite_doctors".* FROM "cite_doctors"  WHERE "cite_doctors"."user_id" = ?  ORDER BY "cite_doctors"."id" DESC LIMIT 7  [["user_id", 91]]
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."user_id" = ? AND "diagnostics"."chronic" = 't'  [["user_id", 91]]
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."user_id" = ? AND "diagnostics"."outstanding" = 't'  [["user_id", 91]]
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."user_id" = ? AND "diagnostics"."serious" = 't'  [["user_id", 91]]
SELECT COUNT(*) FROM "diagnostics"  WHERE "diagnostics"."user_id" = ? AND "diagnostics"."inconsequential" = 't'  [["user_id", 91]]

  def create_session
    @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'jose_alfredo@cursa.me' LIMIT 1

def admin_user_loggin
  @admin = ManagerUser.find_by_email(params[:email])
---
SELECT  "manager_users".* FROM "manager_users"  WHERE "manager_users"."email" = 'jardarubydb@gmail.com' LIMIT 1

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users"  WHERE "users"."id" IN (45, 46, 47, 48, 50, 51, 52, 54, 70, 88, 89, 90, 91)